TARIFS = {
    ("МТС","МТС"): 1.00,
    ("Билайн", "Билайн"): 0.50,
    ("Мегафон", "Мегафон"): 1.50,
    ("Теле2", "Теле2"): 1.00,

    ("МТС","Билайн"): 2.00,
    ("МТС","Мегафон"): 2.50,
    ("МТС", "Теле2"): 1.50,

    ("Билайн", "МТС"): 2.50,
    ("Билайн", "Мегафон"): 3.50,
    ("Билайн", "Теле2"): 3.50,

    ("Мегафон", "МТС"): 3.50,
    ("Мегафон", "Билайн"): 4.50,
    ("Мегафон", "Теле2"): 2.50,

    ("Теле2", "МТС"): 1.00,
    ("Теле2", "Билайн"): 4.00,
    ("Теле2", "Мегафон"): 4.50,
}

OPERATORS = ["МТС", "Билайн", "Мегафон", "Теле2"]

MAX_DURATION = 180
MIN_DURATION = 0.5

