# Задание 1
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
print("Сумма всех чисел равна", a + b + c)

# Задание 1.2
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
print("Произведение всех чисел равно", a * b * c)

# Задание 2
salary = int(input("Введите свою зарплату за месяц: "))
credit = int(input("Введите сумму, которую вы платите за кредит в банке(в месяц): "))
utilities = int(input("Введите сумму вашего коммунального платежа (в месяц): "))
remaining = salary - credit - utilities
print("Остаток ваших средств после всех выплат составляет:", remaining)

# Задание 3
a = float(input("Введите первую длину диагонали ромба: "))
b = float(input("Введите вторую длину диагонали ромба: "))
s = (a * b) * 0.5
print("Площадь ромба равна:", s)

# Задание 4
print("to be")
print("or not")
print("to be")

# Задание 5
print('"Life is what happens\n     when \n         you\'re busy making other plans" \n                                     John Lennon.')